chris-bc/wendigo/esp32/main/wendigo.c
/** Sets Wendigo's logging output to the specified level.
 *  On launch all logging is disabled, to prevent logs being sent over the
 *  UART interface. This function is used to automatically enable/disable
 *  logging when Interactive Mode is started/stopped.
 */
void wendigo_set_logging(esp_log_level_t level) {
    esp_log_level_set(BLE_TAG, level);
    esp_log_level_set(BT_TAG, level);
    esp_log_level_set(TAG, level);
}

/* A generic function that is called by the command handlers for the HCI, BLE, WIFI and INTERACTIVE commands.
   Parses the command line to determine and perform the requested action, sending appropriate messages to the UART
   host throughout. If a command requires `radio` to be enabled or disabled the function pointer `enableFunction()`
   or `disableFunction` is executed. These functions must take no arguments and return esp_err_t (or int).
*/
esp_err_t enableDisableRadios(int argc, char **argv, ScanType radio, esp_err_t (*enableFunction)(), esp_err_t (*disableFunction)()) {
    esp_err_t result = ESP_OK;
    ActionType action = parseCommand(argc, argv);
    if (action == ACTION_INVALID) {
        invalid_command(argv[0], argv[1], syntaxTip[radio]);
        result = ESP_ERR_INVALID_ARG;
    } else {
        /* Acknowledge the message */
        send_response(argv[0], argv[1], MSG_ACK);
        /* Is the radio being turned on, turned off, or queried? */
        switch (action) {
            case ACTION_DISABLE:
                if (scanStatus[radio] == ACTION_ENABLE) {
                    scanStatus[radio] = ACTION_DISABLE;
                    if (disableFunction != NULL) {
                        result = disableFunction();
                    }
                }
                break;
            case ACTION_ENABLE:
                if (scanStatus[radio] == ACTION_DISABLE) {
                    scanStatus[radio] = ACTION_ENABLE;
                    if (enableFunction != NULL) {
                        result = enableFunction();
                    }
                }
                break;
            case ACTION_STATUS:
                if (scanStatus[SCAN_INTERACTIVE] == ACTION_ENABLE) {
                    ESP_LOGI(TAG, "%s Scanning: %s\n", radioFullNames[radio], (scanStatus[radio] == ACTION_ENABLE)?STRING_ACTIVE:STRING_IDLE);
                } else {
                    printf("%s status %d\n", radioShortNames[radio], scanStatus[radio]);
                }
                break;
            default:
                invalid_command(argv[0], argv[1], syntaxTip[radio]);
                result = ESP_ERR_INVALID_ARG;
                break;
        }
    }
    /* Reply with MSG_OK or MSG_FAIL */
    MsgType reply = MSG_OK;
    if (result != ESP_OK) {
        reply = MSG_FAIL;
    }
    send_response(argv[0], argv[1], reply);
    return ESP_OK;
}

esp_err_t cmd_bluetooth(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_HCI, wendigo_bt_enable, wendigo_bt_disable);
    return ESP_OK;
}

esp_err_t cmd_ble(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_BLE, wendigo_ble_enable, wendigo_ble_disable);
    return ESP_OK;
}

esp_err_t cmd_wifi(int argc, char **argv) {
    enableDisableRadios(argc, argv, SCAN_WIFI, wendigo_wifi_enable, wendigo_wifi_disable);
    return ESP_OK;
}

void print_status_row_start(int spaces) {
    print_star(1, false);
    print_space(spaces, false);
}
void print_status_row_end(int spaces) {
    print_space(spaces, false);
    print_star(1, true);
}
void print_empty_row(int lineLength) {
    print_star(1, false);
    print_space(lineLength - 2, false);
    print_star(1, true);
}

void display_status_interactive(bool uuidDictionarySupported, bool btClassicSupported,
                                bool btBLESupported, bool wifiSupported) {
    const char *uuidDictionary = (uuidDictionarySupported) ? STRING_YES : STRING_NO;
    const char *btClassicSupport = (btClassicSupported) ? STRING_YES : STRING_NO;
    const char *btBLESupport = (btBLESupported) ? STRING_YES : STRING_NO;
    const char *wifiSupport = (wifiSupported) ? STRING_YES : STRING_NO;

    print_star(53, true);
    print_empty_row(53);
    print_status_row_start(14);
    printf("Wendigo version %7s", WENDIGO_VERSION);
    print_status_row_end(14);
    print_empty_row(53);
    print_status_row_start(5);
    printf("Chris Bennetts-Cash   github.com/chris-bc");
    print_status_row_end(5);
    print_empty_row(53);
    print_empty_row(53);
    print_status_row_start(4);
    printf("Compiled with Bluetooth Dictionary: %7s", uuidDictionary);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("Bluetooth Classic Supported: %14s", btClassicSupport);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("Bluetooth Low Energy Supported: %11s", btBLESupport);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("WiFi Supported: %27s", wifiSupport);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("Bluetooth Classic Scanning: %15s", (!btClassicSupported) ? STRING_NA : (scanStatus[SCAN_HCI] == ACTION_ENABLE) ? STRING_ACTIVE : STRING_IDLE);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("Bluetooth Low Energy Scanning: %12s", (!btBLESupported) ? STRING_NA : (scanStatus[SCAN_BLE] == ACTION_ENABLE) ? STRING_ACTIVE : STRING_IDLE);
    print_status_row_end(4);
    print_status_row_start(4);
    printf("WiFi Scanning: %28s", (!wifiSupported) ? STRING_NA : (scanStatus[SCAN_WIFI] == ACTION_ENABLE) ? STRING_ACTIVE : STRING_IDLE);
    print_status_row_end(4);
    print_empty_row(53);
    print_star(53, true);
    // Some extra stuff for development
    printf("sizeof(wendigo_bt_device): %d\tsizeof(wendigo_bt_svc): %d\n", sizeof(wendigo_bt_device), sizeof(wendigo_bt_svc));
    printf("sizeof(ScanType): %d\tsizeof(struct timeval): %d\n", sizeof(ScanType), sizeof(struct timeval));
    printf("sizeof(char*): %d\tsizeof(*all_gap_devices): %d\n", sizeof(char*), sizeof(all_gap_devices));
}

/** Send status information to Flipper Zero.
 *  A status packet commences with 4 bytes of 0xEE followed by 4 bytes of 0xBB
 *  This is followed by:
 *  * 1 byte each to indicate support for UUID decoding, BT Classic, BLE & WiFi
 *    (1: supported, 0: unsupported) and status of scanning for BT Classic, BLE
 *    & WiFi (1: Scanning, 0: Idle).
 *  * 2 bytes each (uint16_t) for the count of BT Classic, BLE and WiFi devices.
 *  The packet is terminated with 4 bytes of 0xAA and 4 bytes of 0xFF.
 */
void display_status_uart(bool uuidDictionarySupported, bool btClassicSupported,
                                bool btBLESupported, bool wifiSupported) {
    repeat_bytes(0xEE, 4);
    repeat_bytes(0xBB, 4);
    /* Send feature support information */
    // YAGNI: A single bitmasked byte could replace these 7 bytes, but would introduce another
    //        point of shared knowledge between ESP32 and Flipper applications and is a trivial reduction.
    uint8_t on = 1;
    uint8_t off = 0;
    send_bytes((uuidDictionarySupported) ? &on : &off, 1);
    send_bytes((btClassicSupported) ? &on : &off, 1);
    send_bytes((btBLESupported) ? &on : &off, 1);
    send_bytes((wifiSupported) ? &on : &off, 1);
    send_bytes((scanStatus[SCAN_HCI] == ACTION_ENABLE) ? &on : &off, 1);
    send_bytes((scanStatus[SCAN_BLE] == ACTION_ENABLE) ? &on : &off, 1);
    send_bytes((scanStatus[SCAN_WIFI] == ACTION_ENABLE) ? &on : &off, 1);
    /* num_gap_devices counts both Classic and LE devices. Create separate counts instead */
    uint16_t classicDeviceCount = 0;
    uint16_t leDeviceCount = 0;
    for (uint16_t i = 0; i < num_gap_devices; ++i) {
        switch (all_gap_devices[i].scanType) {
            case SCAN_HCI:
                ++classicDeviceCount;
                break;
            case SCAN_BLE:
                ++leDeviceCount;
                break;
            default:
                /* No action required */
                break;
        }
    }
    send_bytes((uint8_t *)(&classicDeviceCount), 2);
    send_bytes((uint8_t *)(&leDeviceCount), 2);
    // TODO: Add WiFi status information.
    uint16_t wifiFakeCount = 0;
    send_bytes((uint8_t *)(&wifiFakeCount), 2);

